test/3_req.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:pr1="http://schemas.microsoft.com/windows/2014/04/wdp/printV20">
  <soap:Header>
    <wsa:To>http://192.168.1.141:80/wsd/printservice.cgi</wsa:To>
    <wsa:Action>http://schemas.microsoft.com/windows/2014/04/wdp/printV20/PrepareToPrint</wsa:Action>
    <wsa:MessageID>urn:uuid:cf334520-75fc-4a63-9201-1284aa5fade0</wsa:MessageID>
  </soap:Header>
  <soap:Body>
    <pr1:PrepareToPrintRequest/>
  </soap:Body>
</soap:Envelope>
