GetPrintDeviceCapabilities.xml

<?xml version="1.0" encoding="utf-8" ?>
<soap:Envelope
		xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
		xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
		xmlns:wprt="http://schemas.microsoft.com/windows/2006/08/wdp/print"
		xmlns:wprt20="http://schemas.microsoft.com/windows/2014/04/wdp/printV20">
  <soap:Header>
    <wsa:To>%AddressofPrinterService%</wsa:To>
    <wsa:Action>http://schemas.microsoft.com/windows/2014/04/wdp/printV20/GetPrintDeviceCapabilities</wsa:Action>
    <wsa:MessageID>uuid:%UniqueMsgId%</wsa:MessageID>
    <wsa:ReplyTo>
      <wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address>
    </wsa:ReplyTo>
    <wsa:From>
      <wsa:Address>urn:uuid:%SenderGuid%</wsa:Address>
    </wsa:From>
  </soap:Header>
  <soap:Body>
    <wprt20:GetPrintDeviceCapabilitiesRequest>
      <wprt20:PrintDeviceCapabilitiesFormat>
        application/vnd.ms-PrintDeviceCapabilities+xml
      </wprt20:PrintDeviceCapabilitiesFormat>
      <wprt20:PrintDeviceCapabilitiesChangeID>
      </wprt20:PrintDeviceCapabilitiesChangeID>
    </wprt20:GetPrintDeviceCapabilitiesRequest>
  </soap:Body>
</soap:Envelope>
